src/Documents/ВозвратПоставщику/ВозвратПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВозвратПоставщику</name>
  <basedOn>Document.ПоступлениеМПЗ</basedOn>
  <registerRecords>AccumulationRegister.ГТД</registerRecords>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПоступлениеМПЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/Цены/Цены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Цены</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаФактическая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ВозвратПоставщику/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
ЭтотОбъект.ТолькоПросмотр = ОбщийМодульСозданиеДокументов.ЗапретРедактирования(Объект.Ссылка,Истина,Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьМПЗПриИзменении(Элемент)
ТабличнаяЧастьМПЗПриИзмененииНаСервере(Элементы.ТабличнаяЧасть.ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Процедура ТабличнаяЧастьМПЗПриИзмененииНаСервере(Стр)
ТЧ = Объект.ТабличнаяЧасть.НайтиПоИдентификатору(Стр);
ТЧ.ЕдиницаИзмерения = ТЧ.МПЗ.ОсновнаяЕдиницаИзмерения;
	Если ТипЗнч(ТЧ.МПЗ) = Тип("СправочникСсылка.Материалы") Тогда
	ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Материалы;	
	Иначе
	ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты;	
	КонецЕсли; 
Цены = РегистрыСведений.Цены.ПолучитьПоследнее(ТекущаяДата(),Новый Структура("МПЗ",ТЧ.МПЗ));
ТЧ.Цена = Цены.Цена*ТЧ.ЕдиницаИзмерения.Коэффициент;
ТЧ.Сумма = ТЧ.Цена*ТЧ.Количество;
	Если Не Объект.Договор.БезНДС Тогда
	ТЧ.СтавкаНДС = Константы.ОсновнаяСтавкаНДС.Получить();
	ТЧ.НДС = ТЧ.Сумма*ТЧ.СтавкаНДС.Ставка/100;
	КонецЕсли;
ТЧ.Всего = ТЧ.Сумма + ТЧ.НДС;
КонецПроцедуры

&НаСервере
Процедура ПодборМПЗНаСервере(ТаблицаМПЗ)
	Для каждого ТЧ_МПЗ Из ТаблицаМПЗ Цикл
	ТЧ = Объект.ТабличнаяЧасть.Добавить();
		Если ТипЗнч(ТЧ_МПЗ.МПЗ) = Тип("СправочникСсылка.Материалы") Тогда
		ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Материалы;		
		Иначе
		ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты;	
		КонецЕсли; 
	ТЧ.МПЗ = ТЧ_МПЗ.МПЗ;
	ТЧ.Количество = ТЧ_МПЗ.Количество;
	ТЧ.ЕдиницаИзмерения = ТЧ_МПЗ.ЕдиницаИзмерения;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ПодборМПЗ(Команда)
ТаблицаМПЗ = ОткрытьФормуМодально("ОбщаяФорма.ПодборМПЗ", Новый Структура("МестоХранения",Объект.МестоХранения));
	Если ТаблицаМПЗ <> Неопределено Тогда
		Если ТаблицаМПЗ.Количество() > 0 Тогда
			Если Объект.ТабличнаяЧасть.Количество() > 0 Тогда
				Если Вопрос("Очистить таблицу?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				Объект.ТабличнаяЧасть.Очистить();		
				КонецЕсли; 			
			КонецЕсли; 
		ПодборМПЗНаСервере(ТаблицаМПЗ);
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПересчётТабличнойЧасти()
	Для каждого ТЧ Из Объект.ТабличнаяЧасть Цикл
	ТЧ.Сумма = ТЧ.Цена*ТЧ.Количество;	
		Если Объект.Договор.БезНДС Тогда
		ТЧ.СтавкаНДС = Справочники.СтавкиНДС.ПустаяСсылка();
		ТЧ.НДС = 0;
		ТЧ.Всего = ТЧ.Сумма;
		Иначе
		ТЧ.СтавкаНДС = Константы.ОсновнаяСтавкаНДС.Получить();
		ТЧ.НДС = ТЧ.Сумма*ТЧ.СтавкаНДС.Ставка/100;
		ТЧ.Всего = ТЧ.Сумма + ТЧ.НДС;		
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьВидМПЗПриИзменении(Элемент)
Элементы.ТабличнаяЧасть.ТекущиеДанные.МПЗ = Неопределено;
Элементы.ТабличнаяЧасть.ТекущиеДанные.Количество = 0;
Элементы.ТабличнаяЧасть.ТекущиеДанные.ЕдиницаИзмерения = Неопределено;
Элементы.ТабличнаяЧасть.ТекущиеДанные.Цена = 0;
Элементы.ТабличнаяЧасть.ТекущиеДанные.Сумма = 0;
Элементы.ТабличнаяЧасть.ТекущиеДанные.НДС = 0;
Элементы.ТабличнаяЧасть.ТекущиеДанные.Всего = 0;
КонецПроцедуры

&НаСервере
Процедура ТабличнаяЧастьКоличествоПриИзмененииНаСервере(Стр)
ТЧ = Объект.ТабличнаяЧасть.НайтиПоИдентификатору(Стр);
Цены = РегистрыСведений.Цены.ПолучитьПоследнее(ТекущаяДата(),Новый Структура("МПЗ",ТЧ.МПЗ));
ТЧ.Цена = Цены.Цена*ТЧ.ЕдиницаИзмерения.Коэффициент;
ТЧ.Сумма = ТЧ.Цена*ТЧ.Количество;
	Если Не Объект.Договор.БезНДС Тогда
	ТЧ.НДС = ТЧ.Сумма*ТЧ.СтавкаНДС.Ставка/100;
	КонецЕсли;
ТЧ.Всего = ТЧ.Сумма + ТЧ.НДС;
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьКоличествоПриИзменении(Элемент)
ТабличнаяЧастьКоличествоПриИзмененииНаСервере(Элементы.ТабличнаяЧасть.ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Процедура ТабличнаяЧастьЕдиницаИзмеренияПриИзмененииНаСервере(Стр)
ТЧ = Объект.ТабличнаяЧасть.НайтиПоИдентификатору(Стр);
Цены = РегистрыСведений.Цены.ПолучитьПоследнее(ТекущаяДата(),Новый Структура("МПЗ",ТЧ.МПЗ));
ТЧ.Цена = Цены.Цена*ТЧ.ЕдиницаИзмерения.Коэффициент;
ТЧ.Сумма = ТЧ.Цена*ТЧ.Количество;
	Если Не Объект.Договор.БезНДС Тогда
	ТЧ.НДС = ТЧ.Сумма*ТЧ.СтавкаНДС.Ставка/100;
	КонецЕсли;
ТЧ.Всего = ТЧ.Сумма + ТЧ.НДС;
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьЕдиницаИзмеренияПриИзменении(Элемент)
ТабличнаяЧастьЕдиницаИзмеренияПриИзмененииНаСервере(Элементы.ТабличнаяЧасть.ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Процедура ТабличнаяЧастьЦенаПриИзмененииНаСервере(Стр)
ТЧ = Объект.ТабличнаяЧасть.НайтиПоИдентификатору(Стр);
ТЧ.Сумма = ТЧ.Цена*ТЧ.Количество;
	Если Не Объект.Договор.БезНДС Тогда
	ТЧ.НДС = ТЧ.Сумма*ТЧ.СтавкаНДС.Ставка/100;
	КонецЕсли;
ТЧ.Всего = ТЧ.Сумма + ТЧ.НДС;
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьЦенаПриИзменении(Элемент)
ТабличнаяЧастьЦенаПриИзмененииНаСервере(Элементы.ТабличнаяЧасть.ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Процедура ТабличнаяЧастьСуммаПриИзмененииНаСервере(Стр)
ТЧ = Объект.ТабличнаяЧасть.НайтиПоИдентификатору(Стр);
ТЧ.Сумма = ТЧ.Цена/ТЧ.Количество;
	Если Не Объект.Договор.БезНДС Тогда
	ТЧ.НДС = ТЧ.Сумма*ТЧ.СтавкаНДС.Ставка/100;
	КонецЕсли;
ТЧ.Всего = ТЧ.Сумма + ТЧ.НДС;
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьСуммаПриИзменении(Элемент)
ТабличнаяЧастьСуммаПриИзмененииНаСервере(Элементы.ТабличнаяЧасть.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьСтавкаНДСПриИзменении(Элемент)
ТабличнаяЧастьСтавкаНДСПриИзмененииНаСервере(Элементы.ТабличнаяЧасть.ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Процедура ТабличнаяЧастьСтавкаНДСПриИзмененииНаСервере(Стр)
ТЧ = Объект.ТабличнаяЧасть.НайтиПоИдентификатору(Стр);
	Если Не Объект.Договор.БезНДС Тогда
	ТЧ.НДС = ТЧ.Сумма*ТЧ.СтавкаНДС.Ставка/100;
	КонецЕсли;
ТЧ.Всего = ТЧ.Сумма + ТЧ.НДС;
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
ДокументОснованиеПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДокументОснованиеПриИзмененииНаСервере()
	Если Не ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
	Возврат;
	КонецЕсли; 
Объект.ТабличнаяЧасть.Очистить();
Об = РеквизитФормыВЗначение("Объект");
Об.ОбработкаЗаполнения(Объект.ДокументОснование,Истина);
ВыгрузкаТЧ = Об.ТабличнаяЧасть.Выгрузить();
Объект.ТабличнаяЧасть.Загрузить(ВыгрузкаТЧ);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Элементы.ТабличнаяЧастьСтавкаНДС.Видимость = Не Объект.Договор.БезНДС;
Элементы.ТабличнаяЧастьНДС.Видимость = Не Объект.Договор.БезНДС;
КонецПроцедуры

&НаСервере
Процедура ПечатьТорг12НаСервере(ТабДок)
Макет = Документы.ВозвратПоставщику.ПолучитьМакет("Торг12");	 
ОблШапка = Макет.ПолучитьОбласть("Шапка");	
ОблЗаголовок = Макет.ПолучитьОбласть("Заголовок");
ОблСтрока = Макет.ПолучитьОбласть("Строка");
ОблВсего = Макет.ПолучитьОбласть("Всего");
ОблИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
ОблПодвал = Макет.ПолучитьОбласть("Подвал");

ВсегоСтрок = Объект.ТабличнаяЧасть.Количество();
ВыведеноНаСтраницу = 0; ВыведеноВсего = 0;
НомерСтраницы = 1;
// установка размеров секций
ВысотаШапки = 10;
ВысотаПодвала = 8;
СтрокНаСТранице = 22;
// инициализация
ИтогоКоличество = 0;
ИтогоСумма = 0;
ИтогоНДС = 0;
ВсегоСумма = 0;

ОблШапка.Параметры.ОрганизацияАдрес = Константы.НазваниеОрганизации.Получить()+", "+Константы.АдресОрганизации.Получить();
ОблШапка.Параметры.НомерДок = Объект.Номер;
ОблШапка.Параметры.ДатаДок = Формат(Объект.Дата,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.КодОКПО = Константы.КодОКПО.Получить();
ОблШапка.Параметры.КодОКДП = Константы.КодОКДП.Получить();
ОблШапка.Параметры.СтрПлательщик = СокрЛП(Объект.Контрагент.ПолнНаименование)+", "+СокрЛП(Объект.Контрагент.ЮридическийАдрес)+", "+СокрЛП(Объект.Контрагент.Телефоны);
ОблШапка.Параметры.Договор = Объект.Договор;
ТабДок.Вывести(ОблШапка);
ТабДок.Вывести(ОблЗаголовок);
	Для каждого ТЧ Из Объект.ТабличнаяЧасть Цикл	
	НомСтр = "";
	ОблСтрока.Параметры.Наименование = ?(ЗначениеЗаполнено(ТЧ.МПЗ.ПолнНаименование) = 0 ,СокрЛП(ТЧ.МПЗ.ПолнНаименование),СокрЛП(ТЧ.МПЗ.Наименование));
		Если ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Материалы Тогда
		ОблСтрока.Параметры.Код = ТЧ.МПЗ.Код;
		Иначе
		ОблСтрока.Параметры.Код = "";		
		КонецЕсли; 
	ОблСтрока.Параметры.Количество = ТЧ.Количество;
	ОблСтрока.Параметры.ЕдиницаИзмерения = СокрЛП(ТЧ.ЕдиницаИзмерения.Наименование);
	ОблСтрока.Параметры.ЕдиницаИзмеренияКод = ТЧ.ЕдиницаИзмерения.ЕдиницаИзмерения.Код;
	ОблСтрока.Параметры.ЦенаПеч = ТЧ.Цена;
	ОблСтрока.Параметры.СуммаПеч = ТЧ.Сумма;
	ОблСтрока.Параметры.СтавкаНДС = ТЧ.СтавкаНДС;
	ОблСтрока.Параметры.НДСПеч = ТЧ.НДС;
	ОблСтрока.Параметры.СуммаСНДСПеч = ТЧ.Всего;

	ОстатокСтрок = СтрокНаСТранице - ВыведеноНаСтраницу;
	// если 1-я страница, то уменьшим количество строк на высоту шапки
		Если НомерСтраницы = 1 Тогда
		ОстатокСтрок = ОстатокСтрок - ВысотаШапки;
		КонецЕсли;		
			Если ВыведеноВсего = ВсегоСтрок - 1  Тогда
			// выводим последнюю строку
			ОстатокСтрок = ОстатокСтрок - ВысотаПодвала;
			КонецЕсли;		
				Если Не(ОстатокСтрок > 0) Тогда
				// выводим итоги по странице
				ОблИтогоПоСтранице.Параметры.ИтогоКоличество = ИтогоКоличество;
				ОблИтогоПоСтранице.Параметры.ИтогоСумма = ИтогоСумма;
				ОблИтогоПоСтранице.Параметры.ИтогоНДС = ИтогоНДС;
				ОблИтогоПоСтранице.Параметры.ИтогоСуммаСНДС = ВсегоСумма;
				ТабДок.Вывести(ОблИтогоПоСтранице);			
				// переход на новую страницу
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
				ТабДок.Вывести(ОблЗаголовок);
				ВыведеноНаСтраницу = 0;	
				// обнуляем итоги по старанице
				ИтогоКоличество = 0;
				ИтогоСумма = 0;
				ИтогоНДС = 0;
				ВсегоСумма = 0;
				// увеличиваем номер страницы
				НомерСтраницы = НомерСтраницы + 1;
				КонецЕсли;
	ТабДок.Вывести(ОблСтрока);
	ВыведеноНаСтраницу = ВыведеноНаСтраницу + 1;
	ВыведеноВсего      = ВыведеноВсего      + 1;
	// вычисляем итоги
	ИтогоКоличество = ИтогоКоличество + ТЧ.Количество;
	ИтогоСумма      = ИтогоСумма      + ТЧ.Сумма;
	ИтогоНДС      = ИтогоНДС      	  + ТЧ.НДС;
	ВсегоСумма      = ВсегоСумма      + ТЧ.Всего;
	КонецЦикла;
ОблИтогоПоСтранице.Параметры.ИтогоКоличество = ИтогоКоличество;
ОблИтогоПоСтранице.Параметры.ИтогоСумма = ИтогоСумма;
ОблИтогоПоСтранице.Параметры.ИтогоНДС = ИтогоНДС;
ОблИтогоПоСтранице.Параметры.ИтогоСуммаСНДС = ВсегоСумма;
ТабДок.Вывести(ОблИтогоПоСтранице);
ОблВсего.Параметры.ИтогоКоличество = Объект.ТабличнаяЧасть.Итог("Количество");
ОблВсего.Параметры.ИтогоСумма = Объект.ТабличнаяЧасть.Итог("Сумма");
ОблВсего.Параметры.ИтогоНДС = Объект.ТабличнаяЧасть.Итог("НДС");
ОблВсего.Параметры.ИтогоСуммаСНДС = Объект.ТабличнаяЧасть.Итог("Всего"); 
ТабДок.Вывести(ОблВсего);
ОблПодвал.Параметры.КоличествоСтрок = Объект.ТабличнаяЧасть.Количество();
ОблПодвал.Параметры.Руководитель = ОбщийМодульВызовСервера.ПолучитьСотрудникаПоДолжности("Директор завода");
ОблПодвал.Параметры.ГлБухгалтер = ОбщийМодульВызовСервера.ПолучитьСотрудникаПоДолжности("Главный бухгалтер");
ОблПодвал.Параметры.ПредставлениеГода = Лев(Год(Объект.Дата),2);
ТабДок.Вывести(ОблПодвал);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьТорг12(Команда)
	Если ЭтаФорма.Модифицированность Тогда	
	Сообщить("Для печати документ необходимо перепровести.");
	Возврат;		
	КонецЕсли;
ТабДок = Новый ТабличныйДокумент;

ПечатьТорг12НаСервере(ТабДок);
ТабДок.Показать("Форма ТОРГ-12");
КонецПроцедуры
